samuelclay/turntouch-remote/firmware/nrf51/src/main.c
/* Copyright 2015 Turn Touch. All rights reserved.
 * 
 * This is the main sequence for the Turn Touch Remote.
 * 
 * Includes:
 *   - 4 button GPIOs
 *   - Pin interrupts on buttons
 *   - Timer to watch for long presses to signal mode changes
 *   - Bluetooth Softdevice stack
 * 
 */

#include <stdbool.h>
#include <stdint.h>
#include "app_error.h"
#include "app_scheduler.h"
#include "app_timer.h"
#include "app_timer_appsh.h"
#include "app_trace.h"
#include "ble.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_bas.h"
#include "ble_conn_params.h"
#include "ble_dfu.h"
#include "ble_dis.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "boards.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "button_status.h"
#include "device_manager.h"
#include "dfu_app_handler.h"
#include "nordic_common.h"
#include "nrf.h"
#include "nrf51_bitfields.h"
#include "nrf_delay.h"
#include "nrf_drv_gpiote.h"
#include "nrf_error.h"
#include "nrf_gpio.h"
#include "pstorage.h"
#include "rtt.h"
#include "softdevice_handler.h"
#include "main.h"


// ===========
// = Buttons =
// ===========

void bsp_evt_handler(bsp_event_t evt) {
    
    if (evt == BSP_EVENT_KEY_0 ||
        evt == BSP_EVENT_KEY_1 ||
        evt == BSP_EVENT_KEY_2 ||
        evt == BSP_EVENT_KEY_3 ||
        evt == BSP_EVENT_KEY_4 ||
        evt == BSP_EVENT_KEY_5 ||
        evt == BSP_EVENT_KEY_6 ||
        evt == BSP_EVENT_KEY_7) {
        uint32_t err_code;
        bool pushed;
        uint8_t button_state[BUTTON_STATUS_PACKET_BYTES] = {0x0F, 0x00};
        bool mode_change;
        switch (evt)
        {
            case BSP_EVENT_KEY_4:            
            case BSP_EVENT_KEY_5:
            case BSP_EVENT_KEY_6:
            case BSP_EVENT_KEY_7:
                mode_change = true;
                break;
            default:
                break;
        }
    
        // Button down
        if ((evt == BSP_EVENT_KEY_0) || mode_change) {
            app_button_is_pushed(0, &pushed);
            if (pushed) {
                button_state[0] ^= (1 << 0);
                LEDS_ON(BSP_LED_0_MASK);
            } else {
                button_state[0] |= (1 << 0);
                LEDS_OFF(BSP_LED_0_MASK);
            }
        }
        if ((evt == BSP_EVENT_KEY_1) || mode_change) {
            app_button_is_pushed(1, &pushed);
            if (pushed) {
                button_state[0] ^= (1 << 1);
                LEDS_ON(BSP_LED_1_MASK);
            } else {
                button_state[0] |= (1 << 1);
                LEDS_OFF(BSP_LED_1_MASK);
            }
        }
        if ((evt == BSP_EVENT_KEY_2) || mode_change) {
            app_button_is_pushed(2, &pushed);
            if (pushed) {
                button_state[0] ^= (1 << 2);
                LEDS_ON(BSP_LED_2_MASK);
            } else {
                button_state[0] |= (1 << 2);
                LEDS_OFF(BSP_LED_2_MASK);
            }
        }
        if ((evt == BSP_EVENT_KEY_3) || mode_change) {
            app_button_is_pushed(3, &pushed);
            if (pushed) {
                button_state[0] ^= (1 << 3);
                LEDS_ON(BSP_LED_3_MASK);
            } else {
                button_state[0] |= (1 << 3);
                LEDS_OFF(BSP_LED_3_MASK);
            }
        }
    
        // Mode change
        if ((evt == BSP_EVENT_KEY_4) || 
            (evt == BSP_EVENT_KEY_5) ||
            (evt == BSP_EVENT_KEY_6) ||
            (evt == BSP_EVENT_KEY_7)) {
            button_state[1] |= 0xFF;
            LEDS_ON(LEDS_MASK);
        }    
    
        if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
            err_code = ble_buttonstatus_on_button_change(&m_buttonservice, button_state);
            if (err_code == BLE_ERROR_GATTS_SYS_ATTR_MISSING) {
                // Can ignore this error, just means that bluetooth is connected but nobody's listening yet
                rtt_print(0, "BLE_ERROR_GATTS_SYS_ATTR_MISSING\n");
            } else {
                APP_ERROR_CHECK(err_code);
            }
        } else {
            rtt_print(0, "%sIgnoring button, not connected: %s%X/%X\n", RTT_CTRL_TEXT_BRIGHT_BLACK, RTT_CTRL_TEXT_BLUE, m_conn_handle, BLE_GAP_EVT_CONNECTED);
        }
    } else {
        rtt_print(0, "%sUnhandled bsp_evt: %s%X%s\n", RTT_CTRL_TEXT_RED, RTT_CTRL_TEXT_BRIGHT_RED, evt, RTT_CTRL_RESET);
    }
}

// ================
// = Initializers =
// ================

/**@brief Function for initializing low frequency clock.
 */
void clock_initialization()
{
    NRF_CLOCK->LFCLKSRC            = (CLOCK_LFCLKSRC_SRC_Xtal << CLOCK_LFCLKSRC_SRC_Pos);
    NRF_CLOCK->EVENTS_LFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_LFCLKSTART    = 1;

    while (NRF_CLOCK->EVENTS_LFCLKSTARTED == 0)
    {
        // Do nothing.
    }
    NRF_CLOCK->EVENTS_LFCLKSTARTED = 0;
}


void storage_init() {
    uint32_t err_code;
    
    err_code = pstorage_init();
    
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing bsp module.
 */
void bsp_configuration()
{
    // bsp_event_t startup_event;
    uint32_t err_code;

    err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                        APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                        bsp_evt_handler);
    APP_ERROR_CHECK(err_code);
    
    // err_code = bsp_btn_ble_init(NULL, &startup_event);
    // APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Event Scheduler initialization.
 *
 * The scheduler is used for transferring execution from the interrupt context to the main context.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

// void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
// {
//     nrf_drv_gpiote_out_toggle(PIN_OUT);
//     rtt_print(0, "%sPin toggle: %s%d%s\n", RTT_CTRL_TEXT_YELLOW, RTT_CTRL_TEXT_BRIGHT_YELLOW, pin, RTT_CTRL_RESET);
// }

/**
 * @brief Function for configuring: PIN_IN pin for input, PIN_OUT pin for output, 
 * and configures GPIOTE to give an interrupt on pin change.
 */
// static void gpio_init(void)
// {
//     ret_code_t err_code;
//
//     err_code = nrf_drv_gpiote_init();
//     APP_ERROR_CHECK(err_code);
//
//     nrf_drv_gpiote_out_config_t out_config = GPIOTE_CONFIG_OUT_SIMPLE(false);
//
//     err_code = nrf_drv_gpiote_out_init(PIN_OUT, &out_config);
//     APP_ERROR_CHECK(err_code);
//
//     nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_TOGGLE(true);
//     in_config.pull = NRF_GPIO_PIN_PULLUP;
//
//     err_code = nrf_drv_gpiote_in_init(PIN_IN, &in_config, in_pin_handler);
//     APP_ERROR_CHECK(err_code);
//
//     nrf_drv_gpiote_in_event_enable(PIN_IN, true);
// }

// =================
// = Battery Level =
// =================

uint8_t battery_level_get(void)
{
    // Configure ADC
    NRF_ADC->CONFIG     = (ADC_CONFIG_RES_8bit                        << ADC_CONFIG_RES_Pos)     |
                          (ADC_CONFIG_INPSEL_SupplyOneThirdPrescaling << ADC_CONFIG_INPSEL_Pos)  |
                          (ADC_CONFIG_REFSEL_VBG                      << ADC_CONFIG_REFSEL_Pos)  |
                          (ADC_CONFIG_PSEL_Disabled                   << ADC_CONFIG_PSEL_Pos)    |
                          (ADC_CONFIG_EXTREFSEL_None                  << ADC_CONFIG_EXTREFSEL_Pos);
    NRF_ADC->EVENTS_END = 0;
    NRF_ADC->ENABLE     = ADC_ENABLE_ENABLE_Enabled;

    NRF_ADC->EVENTS_END  = 0;    // Stop any running conversions.
    NRF_ADC->TASKS_START = 1;
    
    while (!NRF_ADC->EVENTS_END)
    {
    }
    
