samuelclay/turntouch-remote/firmware/nrf51/src/main.c
        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
            rtt_print(0, "%sConnection params update\n", RTT_CTRL_TEXT_BLUE);
            break;
            
        case BLE_GATTS_EVT_WRITE:
            //p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
            //rtt_print(0, "%sGatt written to by client: %s%X\n", RTT_CTRL_TEXT_BLUE, RTT_CTRL_TEXT_BRIGHT_BLUE, p_evt_write);
            break;

        case BLE_EVT_USER_MEM_REQUEST:
            rtt_print(0, "%sBluetooth user mem request (%X)\n", RTT_CTRL_TEXT_BLUE, p_ble_evt->evt.gap_evt.conn_handle);
            m_mem_block.p_mem = &m_mem_queue[0];
            m_mem_block.len = MEM_BLOCK_SIZE;
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gap_evt.conn_handle, &m_mem_block);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_EVT_USER_MEM_RELEASE:
            rtt_print(0, "%sBluetooth user mem release (%X, %X)\n", RTT_CTRL_TEXT_BLUE, p_ble_evt->evt.gap_evt.conn_handle, *((uint16_t *)m_mem_block.p_mem));
            if (p_ble_evt->evt.common_evt.params.user_mem_release.mem_block.p_mem == m_mem_block.p_mem) {
            
            }
            break;

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
            rtt_print(0, "%sBluetooth RW authorize request: %X == %X/%x, %X\n", RTT_CTRL_TEXT_BLUE, p_ble_evt->evt.gatts_evt.params.write.op, BLE_GATTS_OP_PREP_WRITE_REQ, BLE_GATTS_OP_EXEC_WRITE_REQ_NOW, p_ble_evt->evt.gatts_evt.params.write.data[0]);
            m_rw_authorize_reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
            m_rw_authorize_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
            
            err_code = sd_ble_gatts_rw_authorize_reply(m_conn_handle, &m_rw_authorize_reply);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            rtt_print(0, "%sBluetooth event unhandled: %s%X(%d)%s\n", RTT_CTRL_TEXT_BLUE, RTT_CTRL_TEXT_BRIGHT_BLUE, p_ble_evt->header.evt_id, p_ble_evt->header.evt_len, RTT_CTRL_RESET);
            break;
    }
}

// =======
// = DFU =
// =======

/**@brief Function for stopping advertising.
 */
static void advertising_stop(void)
{
    uint32_t err_code;

    err_code = sd_ble_gap_adv_stop();
    APP_ERROR_CHECK(err_code);

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for loading application-specific context after establishing a secure connection.
 *
 * @details This function will load the application context and check if the ATT table is marked as 
 *          changed. If the ATT table is marked as changed, a Service Changed Indication
 *          is sent to the peer if the Service Changed CCCD is set to indicate.
 *
 * @param[in] p_handle The Device Manager handle that identifies the connection for which the context 
 *                     should be loaded.
 */
static void app_context_load(dm_handle_t const * p_handle)
{
    uint32_t                 err_code;
    static uint32_t          context_data;
    dm_application_context_t context;

    context.len    = sizeof(context_data);
    context.p_data = (uint8_t *)&context_data;

    err_code = dm_application_context_get(p_handle, &context);
    if (err_code == NRF_SUCCESS)
    {
        // Send Service Changed Indication if ATT table has changed.
        if ((context_data & (DFU_APP_ATT_TABLE_CHANGED << DFU_APP_ATT_TABLE_POS)) != 0)
        {
            err_code = sd_ble_gatts_service_changed(m_conn_handle, APP_SERVICE_HANDLE_START, BLE_HANDLE_MAX);
            if ((err_code != NRF_SUCCESS) &&
                (err_code != BLE_ERROR_INVALID_CONN_HANDLE) &&
                (err_code != NRF_ERROR_INVALID_STATE) &&
                (err_code != BLE_ERROR_NO_TX_BUFFERS) &&
                (err_code != NRF_ERROR_BUSY) &&
                (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
            {
                APP_ERROR_HANDLER(err_code);
            }
        }

        err_code = dm_application_context_delete(p_handle);
        APP_ERROR_CHECK(err_code);
    }
    else if (err_code == DM_NO_APP_CONTEXT)
    {
        // No context available. Ignore.
    }
    else
    {
        APP_ERROR_HANDLER(err_code);
    }
}


/**@brief Function for preparing for system reset.
 *
 * @details This function implements @ref dfu_app_reset_prepare_t. It will be called by 
 *          @ref dfu_app_handler.c before entering the bootloader/DFU.
 *          This allows the current running application to shut down gracefully.
 */
static void reset_prepare(void)
{
    uint32_t err_code;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        // Disconnect from peer.
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        err_code = bsp_indication_set(BSP_INDICATE_IDLE);
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        // If not connected, the device will be advertising. Hence stop the advertising.
        advertising_stop();
    }

    err_code = ble_conn_params_stop();
    APP_ERROR_CHECK(err_code);

    nrf_delay_ms(500);
}

// ============
// = Services =
// ============

static void firmware_nickname_write_handler(ble_buttonservice_t *p_buttonservice, uint8_t* nickname) {
    // ble_gatts_value_t gatts_value;
    // uint8_t  cccd_value_buf[FIRMWARE_NICKNAME_MAX_LENGTH];
     uint32_t err_code;
    
    // // Initialize value struct.
    // memset(&gatts_value, 0, sizeof(gatts_value));
    //
    // gatts_value.len     = FIRMWARE_NICKNAME_MAX_LENGTH;
    // gatts_value.offset  = 0;
    // gatts_value.p_value = cccd_value_buf;
    //
    // err_code = sd_ble_gatts_value_get(p_buttonservice->conn_handle,
    //                                   p_buttonservice->firmware_nickname_char_handles.cccd_handle,
    //                                   &gatts_value);
    // if (err_code == NRF_SUCCESS)
    // {
    //     nickname = gatts_value.p_value;
        /*rtt_print(0, "%s%sNew nickname : %s%s - %s%s\n", RTT_CTRL_BG_BLUE, RTT_CTRL_TEXT_BRIGHT_WHITE,
                  RTT_CTRL_TEXT_BRIGHT_GREEN, nickname, m_mem_block.p_mem, RTT_CTRL_RESET);*/
									
				//rtt_print(0, "New nickname : %s\n", nickname);
        memcpy(m_nickname_storage, nickname, FIRMWARE_NICKNAME_MAX_LENGTH);
				
				// flash must be cleared before saving new data to it
				err_code = pstorage_clear(&m_flash_handle,PSTORAGE_MAX_BLOCK_SIZE);
        
				APP_ERROR_CHECK(err_code);
    // } else {
    //     rtt_print(0, "Nickname error: %X, %X\n", err_code, gatts_value.p_value[8]);
    //     for (int i=0;i < gatts_value.len; i++) {
    //         SEGGER_RTT_printf(0, "%X", gatts_value.p_value[i]);
    //     }
    // }
}

static void pstorage_callback_handler(pstorage_handle_t * handle,
                                      uint8_t             op_code,
                                      uint32_t            reason,
                                      uint8_t           * p_data,
                                      uint32_t            param_len)
{
		
