samuelclay/turntouch-remote/firmware/nrf51/src/main.c
		switch(op_code)
    {
        case PSTORAGE_ERROR_OP_CODE:
						
            break;
        case PSTORAGE_STORE_OP_CODE: 
            if (reason != NRF_SUCCESS)
						{
								rtt_print(0, "pstorage store error: %x\n", reason);
						} else {
								rtt_print(0, "pstorage store success: \n");
								for (int i = 0; i <param_len; i++)
								{
										SEGGER_RTT_printf(0,"%02X ", p_data[i]);
								}
								SEGGER_RTT_printf(0,"\n");
								SEGGER_RTT_Write(0,p_data,param_len);
								SEGGER_RTT_printf(0,"\n");
						}        
            break;
        case PSTORAGE_LOAD_OP_CODE:
            if (reason != NRF_SUCCESS)
						{
								rtt_print(0, "pstorage load error: %x\n", reason);
						} else {
								rtt_print(0, "pstorage load success: \n");
								for (int i = 0; i <param_len; i++)
								{
										SEGGER_RTT_printf(0,"%02X ", p_data[i]);
								}
								SEGGER_RTT_printf(0,"\n");
								SEGGER_RTT_Write(0,p_data,param_len);
								SEGGER_RTT_printf(0,"\n");
						}
            break;
        case PSTORAGE_CLEAR_OP_CODE:
				if (reason != NRF_SUCCESS)
						{
								rtt_print(0, "pstorage clear error: %x\n", reason);
						} else {
								rtt_print(0, "pstorage clear success:\n");
								//save new nickname
                uint32_t err_code = pstorage_store(&m_flash_handle,
                       m_nickname_storage,
                       FIRMWARE_NICKNAME_MAX_LENGTH,
                       0);
								APP_ERROR_CHECK(err_code);
						}
            break;
        case PSTORAGE_UPDATE_OP_CODE:
                
            break;
        default:
                
            break;
    }
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t                err_code;
    ble_buttonstatus_init_t init;
    ble_bas_init_t          bas_init;
    ble_dis_init_t          dis_init;
    ble_dfu_init_t          dfus_init;
    pstorage_module_param_t params;
    
    // Nickname
    init.firmware_nickname_write_handler = firmware_nickname_write_handler;
    
    params.block_size   = FIRMWARE_NICKNAME_MAX_LENGTH;
    params.block_count  = 1;
    params.cb           = pstorage_callback_handler;
    
    err_code = pstorage_register(&params, &m_flash_handle);
		APP_ERROR_CHECK(err_code);
    
		memset(init.nickname_str, 0, FIRMWARE_NICKNAME_MAX_LENGTH);
    memcpy(init.nickname_str, m_nickname_storage, FIRMWARE_NICKNAME_MAX_LENGTH);
    rtt_print(0, "Setting nickname: \n");
		
		err_code = pstorage_load(m_nickname_storage, &m_flash_handle, FIRMWARE_NICKNAME_MAX_LENGTH, 0);
		APP_ERROR_CHECK(err_code);
    

    // Button Service
    err_code = ble_buttonstatus_init(&m_buttonservice, &init);
    APP_ERROR_CHECK(err_code);

    // Battery Service
    memset(&bas_init, 0, sizeof(bas_init));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);
    
    // Initialize Device Information Service
    memset(&dis_init, 0, sizeof(dis_init));
    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, MANUFACTURER_NAME);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);
    
    err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);
    
    // Initialize the Device Firmware Update Service.
    memset(&dfus_init, 0, sizeof(dfus_init));

    dfus_init.evt_handler   = dfu_app_on_dfu_evt;
    dfus_init.error_handler = NULL;
    dfus_init.evt_handler   = dfu_app_on_dfu_evt;
    dfus_init.revision      = DFU_REVISION;

    err_code = ble_dfu_init(&m_dfus, &dfus_init);
    APP_ERROR_CHECK(err_code);

    dfu_app_reset_prepare_set(reset_prepare);
    dfu_app_dm_appl_instance_set(m_app_handle);
}

// =========
// = Power =
// =========


static void gpio_start(void) {
    NVIC_EnableIRQ(GPIOTE_IRQn);
    NRF_GPIOTE->INTENSET = GPIOTE_INTENSET_PORT_Set << GPIOTE_INTENSET_PORT_Pos;
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    uint32_t err_code;
    
    // Initialize timer module, making it use the scheduler
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, true);
    
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    rtt_print(0, "%sSleeping...%s\n", RTT_CTRL_TEXT_BRIGHT_RED, RTT_CTRL_RESET);

    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    SEGGER_RTT_Init();
    
    rtt_print(0, "%s%sStarting up Turn Touch Remote%s\n", RTT_CTRL_TEXT_BRIGHT_YELLOW,
                                                          RTT_CTRL_BG_BRIGHT_MAGENTA, 
                                                          RTT_CTRL_RESET);
    
    // Initialize buttons
    clock_initialization();
    timers_init();
    bsp_configuration();

    // Initialize
    ble_stack_init();
    scheduler_init();
    device_manager_init();
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
    sec_params_init();

    // Start execution
    gpio_start();
    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    APP_ERROR_CHECK(err_code);

    while (true)
    {
        app_sched_execute();
        power_manage();
    }
}


/**
 * @}
 */
